<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"d0bc429823a17576fd41401872d98f3f6bd8140a7b42191bc9dee52e344e649b","plan_job_ref":"Job .github/workflows/_test-tf.yaml #99 at https://github.com/DND-IT/github-workflows/actions/runs/16682351313","plan_out_hash":"0ff7e72a0ec3e9eb0f0adee99d07ed858025591decb04fa867bec19e32fa7b90","plan_hash":"204792260ff38659f4209ff07063c31fcf3d75f1da2ab9bf4971d17f1be3f68f","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #99](https://github.com/DND-IT/github-workflows/actions/runs/16682351313)